# FilterStringBeginsWith Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringBeginsWith Constructor
FilterStringBeginsWith Class See Also
---
Constructs an instance of FilterStringBeginsWith.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringBeginsWith()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterStringBeginsWith()
```

# See Also
FilterStringBeginsWith Class
Autodesk.Revit.DB Namespace